app/controllers/babies_controller.rb

  def index
    @babies = current_user.babies
    @babies.each do |baby|
---
SELECT "babies".* FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]

  def show
    baby_id = (params[:id]).to_i

    if current_user.babies.ids.include?(baby_id)
      @baby = Baby.find(params[:id])
---
SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @baby = current_user.babies.create(baby_params)
---
INSERT INTO "babies" ("name", "birthday", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Asa Piggot"], ["birthday", "2013-10-02 00:00:00.000000"], ["user_id", 4], ["created_at", "2015-05-07 16:29:24.707626"], ["updated_at", "2015-05-07 16:29:24.707626"]]