app/controllers/media_controller.rb

  def new
    if current_user.babies.ids.include?(current_baby)
      @baby = Baby.find(params[:baby_id])
      @event = Event.find(params[:event_id])
---
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]

  def create
    # render plain: params
    uploaded_file = params[:medium][:url].path
    cloudinary_file = Cloudinary::Uploader.upload(uploaded_file)

    # render json: cloudinary_file
    @baby = Baby.find(params[:baby_id])
    @event = Event.find(params[:event_id])
    # render json: @event
    @event.media.create url: cloudinary_file['public_id']
---
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "media" ("url", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["url", "wguuwaxpzchreaz33sic"], ["event_id", 2], ["created_at", "2015-05-08 05:48:04.906536"], ["updated_at", "2015-05-08 05:48:04.906536"]]