app/controllers/stats_controller.rb

  def index

    @csv = CSV.foreach(("male_length.csv"), :headers => true, :header_converters => :symbol)
    @csv1 = CSV.foreach(("female_length.csv"), :headers => true, :header_converters => :symbol)
    @csv2 = CSV.foreach(("male_weight.csv"), :headers => true, :header_converters => :symbol)
    @csv3 = CSV.foreach(("female_weight.csv"), :headers => true, :header_converters => :symbol)
    @data = render_data @csv
    @data1 = render_data @csv1
    @data2 = render_data @csv2
    @data3 = render_data @csv3
    if current_user.babies.ids.include?(current_baby)
      @baby = Baby.find(params[:baby_id])
      @stats = Baby.find(params[:baby_id]).stats
---
SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", nil]]
SELECT  "stats".* FROM "stats" WHERE "stats"."baby_id" = $1 LIMIT 1  [["baby_id", 2]]

  def new

    if current_user.babies.ids.include?(current_baby)
      @stat = Stat.new
      @baby = Baby.find(params[:baby_id])
---
SELECT "babies"."id" FROM "babies" WHERE "babies"."user_id" = $1  [["user_id", 4]]
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]

  def create

    if current_user.babies.ids.include?(current_baby)
      @baby = Baby.find(params[:baby_id])
      @stat = Stat.create(stat_params)
---
SELECT  "babies".* FROM "babies" WHERE "babies"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "stats" ("height", "weight", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["height", 34.0], ["weight", 34.0], ["date", "2015-02-01 00:00:00.000000"], ["created_at", "2015-05-07 02:51:02.324937"], ["updated_at", "2015-05-07 02:51:02.324937"]]